app/controllers/pages_controller.rb

  def index
    @menu=Menu.all
    @submenu=Submenu.all
    @banner=Banner.all
---
SELECT "menus".* FROM "menus"
SELECT "banners".* FROM "banners"

  def aboutus
    @menu=Menu.all
---
SELECT "menus".* FROM "menus"